content/posts/silva2018.md
+++
title = "silva2018 | Whole-body Control of a Mobile Manipulator Using Feedback Linearization and Dual Quaternion Algebra"
author = ["João Gutemberg Farias"]
draft = false
+++

The papers proposes a [whole-body control]({{< relref "whole_body_control" >}}) using [Feedback Linearization]({{< relref "feedback_linearization" >}}) in a DQ framework. Experiments are made using a nonholonomic mobile ground vehicle with 5-DOF [manipulator arm]({{< relref "serial_mechanism" >}}).


## Info {#info}

This paper presents the whole-body control of a nonholonomic mobile manipulator using feedback linearization and dual quaternion algebra. The controller, whose reference is a unit dual quaternion representing the desired end-effector pose, acts as a dynamic trajectory generator for the end-effector, and input signals for both nonholonomic mobile base and manipulator arm are generated by using the pseudoinverse of the whole-body Jacobian matrix. In order to deal with the nonholonomic constraints, the input signal to the mobile base generated by the wholebody motion control is properly remapped to ensure feasibility. The Lyapunov stability for the proposed controller is presented and experimental results on a real platform are performed in order to compare the proposed scheme to a traditional classic whole-body linear kinematic controller. The results show that, for similar convergence rate, the nonlinear controller is capable of generating smoother movements while having lower control effort than the linear controller.


## Notes {#notes}


### Resumo {#resumo}

The papers proposes a whole-body control using Feedback Linearization in a DQ framework. Experiments are made using a nonholonomic mobile ground vehicle with 5-DOF manipulator arm.
